MikroElektronika/core_packages/PIC/XC8/def/PIC18LF46J13/mcu.h
extern volatile TMR5Lbits_t TMR5Lbits __at(0xF23);
// bitfield macros
#define _TMR5L_TMR5L_POSN                                   0x0
#define _TMR5L_TMR5L_POSITION                               0x0
#define _TMR5L_TMR5L_SIZE                                   0x8
#define _TMR5L_TMR5L_LENGTH                                 0x8
#define _TMR5L_TMR5L_MASK                                   0xFF

// Register: TMR5H
#define TMR5H TMR5H
extern volatile unsigned char           TMR5H               __at(0xF24);
#ifndef _LIB_BUILD
asm("TMR5H equ 0F24h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR5H                  :8;
    };
} TMR5Hbits_t;
extern volatile TMR5Hbits_t TMR5Hbits __at(0xF24);
// bitfield macros
#define _TMR5H_TMR5H_POSN                                   0x0
#define _TMR5H_TMR5H_POSITION                               0x0
#define _TMR5H_TMR5H_SIZE                                   0x8
#define _TMR5H_TMR5H_LENGTH                                 0x8
#define _TMR5H_TMR5H_MASK                                   0xFF

// Register: CM3CON
#define CM3CON CM3CON
extern volatile unsigned char           CM3CON              __at(0xF25);
#ifndef _LIB_BUILD
asm("CM3CON equ 0F25h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCH                    :2;
        unsigned CREF                   :1;
        unsigned EVPOL                  :2;
        unsigned CPOL                   :1;
        unsigned COE                    :1;
        unsigned CON                    :1;
    };
    struct {
        unsigned CCH0                   :1;
        unsigned CCH1                   :1;
        unsigned                        :1;
        unsigned EVPOL0                 :1;
        unsigned EVPOL1                 :1;
    };
    struct {
        unsigned CCH03                  :1;
        unsigned CCH13                  :1;
        unsigned CREF3                  :1;
        unsigned EVPOL03                :1;
        unsigned EVPOL13                :1;
        unsigned CPOL3                  :1;
        unsigned COE3                   :1;
        unsigned CON3                   :1;
    };
} CM3CONbits_t;
extern volatile CM3CONbits_t CM3CONbits __at(0xF25);
// bitfield macros
#define _CM3CON_CCH_POSN                                    0x0
#define _CM3CON_CCH_POSITION                                0x0
#define _CM3CON_CCH_SIZE                                    0x2
#define _CM3CON_CCH_LENGTH                                  0x2
#define _CM3CON_CCH_MASK                                    0x3
#define _CM3CON_CREF_POSN                                   0x2
#define _CM3CON_CREF_POSITION                               0x2
#define _CM3CON_CREF_SIZE                                   0x1
#define _CM3CON_CREF_LENGTH                                 0x1
#define _CM3CON_CREF_MASK                                   0x4
#define _CM3CON_EVPOL_POSN                                  0x3
#define _CM3CON_EVPOL_POSITION                              0x3
#define _CM3CON_EVPOL_SIZE                                  0x2
#define _CM3CON_EVPOL_LENGTH                                0x2
#define _CM3CON_EVPOL_MASK                                  0x18
#define _CM3CON_CPOL_POSN                                   0x5
#define _CM3CON_CPOL_POSITION                               0x5
#define _CM3CON_CPOL_SIZE                                   0x1
#define _CM3CON_CPOL_LENGTH                                 0x1
#define _CM3CON_CPOL_MASK                                   0x20
#define _CM3CON_COE_POSN                                    0x6
#define _CM3CON_COE_POSITION                                0x6
#define _CM3CON_COE_SIZE                                    0x1
#define _CM3CON_COE_LENGTH                                  0x1
#define _CM3CON_COE_MASK                                    0x40
#define _CM3CON_CON_POSN                                    0x7
#define _CM3CON_CON_POSITION                                0x7
#define _CM3CON_CON_SIZE                                    0x1
#define _CM3CON_CON_LENGTH                                  0x1
#define _CM3CON_CON_MASK                                    0x80
#define _CM3CON_CCH0_POSN                                   0x0
#define _CM3CON_CCH0_POSITION                               0x0
#define _CM3CON_CCH0_SIZE                                   0x1
#define _CM3CON_CCH0_LENGTH                                 0x1
#define _CM3CON_CCH0_MASK                                   0x1
#define _CM3CON_CCH1_POSN                                   0x1
#define _CM3CON_CCH1_POSITION                               0x1
#define _CM3CON_CCH1_SIZE                                   0x1
#define _CM3CON_CCH1_LENGTH                                 0x1
#define _CM3CON_CCH1_MASK                                   0x2
#define _CM3CON_EVPOL0_POSN                                 0x3
#define _CM3CON_EVPOL0_POSITION                             0x3
#define _CM3CON_EVPOL0_SIZE                                 0x1
#define _CM3CON_EVPOL0_LENGTH                               0x1
#define _CM3CON_EVPOL0_MASK                                 0x8
#define _CM3CON_EVPOL1_POSN                                 0x4
#define _CM3CON_EVPOL1_POSITION                             0x4
#define _CM3CON_EVPOL1_SIZE                                 0x1
#define _CM3CON_EVPOL1_LENGTH                               0x1
#define _CM3CON_EVPOL1_MASK                                 0x10
#define _CM3CON_CCH03_POSN                                  0x0
#define _CM3CON_CCH03_POSITION                              0x0
#define _CM3CON_CCH03_SIZE                                  0x1
#define _CM3CON_CCH03_LENGTH                                0x1
#define _CM3CON_CCH03_MASK                                  0x1
#define _CM3CON_CCH13_POSN                                  0x1
#define _CM3CON_CCH13_POSITION                              0x1
#define _CM3CON_CCH13_SIZE                                  0x1
#define _CM3CON_CCH13_LENGTH                                0x1
#define _CM3CON_CCH13_MASK                                  0x2
#define _CM3CON_CREF3_POSN                                  0x2
#define _CM3CON_CREF3_POSITION                              0x2
#define _CM3CON_CREF3_SIZE                                  0x1
#define _CM3CON_CREF3_LENGTH                                0x1
#define _CM3CON_CREF3_MASK                                  0x4
#define _CM3CON_EVPOL03_POSN                                0x3
#define _CM3CON_EVPOL03_POSITION                            0x3
#define _CM3CON_EVPOL03_SIZE                                0x1
#define _CM3CON_EVPOL03_LENGTH                              0x1
#define _CM3CON_EVPOL03_MASK                                0x8
#define _CM3CON_EVPOL13_POSN                                0x4
#define _CM3CON_EVPOL13_POSITION                            0x4
#define _CM3CON_EVPOL13_SIZE                                0x1
#define _CM3CON_EVPOL13_LENGTH                              0x1
#define _CM3CON_EVPOL13_MASK                                0x10
#define _CM3CON_CPOL3_POSN                                  0x5
#define _CM3CON_CPOL3_POSITION                              0x5
#define _CM3CON_CPOL3_SIZE                                  0x1
#define _CM3CON_CPOL3_LENGTH                                0x1
#define _CM3CON_CPOL3_MASK                                  0x20
#define _CM3CON_COE3_POSN                                   0x6
#define _CM3CON_COE3_POSITION                               0x6
#define _CM3CON_COE3_SIZE                                   0x1
#define _CM3CON_COE3_LENGTH                                 0x1
#define _CM3CON_COE3_MASK                                   0x40
#define _CM3CON_CON3_POSN                                   0x7
#define _CM3CON_CON3_POSITION                               0x7
#define _CM3CON_CON3_SIZE                                   0x1
#define _CM3CON_CON3_LENGTH                                 0x1
#define _CM3CON_CON3_MASK                                   0x80

// Register: RTCVALL
#define RTCVALL RTCVALL
extern volatile unsigned char           RTCVALL             __at(0xF3A);
#ifndef _LIB_BUILD
asm("RTCVALL equ 0F3Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RTCVALL                :8;
    };
} RTCVALLbits_t;
extern volatile RTCVALLbits_t RTCVALLbits __at(0xF3A);
// bitfield macros
#define _RTCVALL_RTCVALL_POSN                               0x0
#define _RTCVALL_RTCVALL_POSITION                           0x0
#define _RTCVALL_RTCVALL_SIZE                               0x8
#define _RTCVALL_RTCVALL_LENGTH                             0x8
#define _RTCVALL_RTCVALL_MASK                               0xFF

// Register: RTCVALH
#define RTCVALH RTCVALH
extern volatile unsigned char           RTCVALH             __at(0xF3B);
#ifndef _LIB_BUILD
asm("RTCVALH equ 0F3Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RTCVALH                :8;
    };
    struct {
        unsigned WAITE0                 :1;
        unsigned WAITE1                 :1;
        unsigned WAITM0                 :1;
        unsigned WAITM1                 :1;
        unsigned WAITM2                 :1;
        unsigned WAITM3                 :1;
        unsigned WAITB0                 :1;
        unsigned WAITB1                 :1;
    };
} RTCVALHbits_t;
