MikroElektronika/core_packages/PIC/XC8/def/PIC18LF46J13/mcu.h
// Register: CVRCON
#define CVRCON CVRCON
extern volatile unsigned char           CVRCON              __at(0xF53);
#ifndef _LIB_BUILD
asm("CVRCON equ 0F53h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CVR                    :4;
        unsigned CVRSS                  :1;
        unsigned CVRR                   :1;
        unsigned CVROE                  :1;
        unsigned CVREN                  :1;
    };
    struct {
        unsigned CVR0                   :1;
        unsigned CVR1                   :1;
        unsigned CVR2                   :1;
        unsigned CVR3                   :1;
    };
    struct {
        unsigned                        :6;
        unsigned CVROEN                 :1;
    };
} CVRCONbits_t;
extern volatile CVRCONbits_t CVRCONbits __at(0xF53);
// bitfield macros
#define _CVRCON_CVR_POSN                                    0x0
#define _CVRCON_CVR_POSITION                                0x0
#define _CVRCON_CVR_SIZE                                    0x4
#define _CVRCON_CVR_LENGTH                                  0x4
#define _CVRCON_CVR_MASK                                    0xF
#define _CVRCON_CVRSS_POSN                                  0x4
#define _CVRCON_CVRSS_POSITION                              0x4
#define _CVRCON_CVRSS_SIZE                                  0x1
#define _CVRCON_CVRSS_LENGTH                                0x1
#define _CVRCON_CVRSS_MASK                                  0x10
#define _CVRCON_CVRR_POSN                                   0x5
#define _CVRCON_CVRR_POSITION                               0x5
#define _CVRCON_CVRR_SIZE                                   0x1
#define _CVRCON_CVRR_LENGTH                                 0x1
#define _CVRCON_CVRR_MASK                                   0x20
#define _CVRCON_CVROE_POSN                                  0x6
#define _CVRCON_CVROE_POSITION                              0x6
#define _CVRCON_CVROE_SIZE                                  0x1
#define _CVRCON_CVROE_LENGTH                                0x1
#define _CVRCON_CVROE_MASK                                  0x40
#define _CVRCON_CVREN_POSN                                  0x7
#define _CVRCON_CVREN_POSITION                              0x7
#define _CVRCON_CVREN_SIZE                                  0x1
#define _CVRCON_CVREN_LENGTH                                0x1
#define _CVRCON_CVREN_MASK                                  0x80
#define _CVRCON_CVR0_POSN                                   0x0
#define _CVRCON_CVR0_POSITION                               0x0
#define _CVRCON_CVR0_SIZE                                   0x1
#define _CVRCON_CVR0_LENGTH                                 0x1
#define _CVRCON_CVR0_MASK                                   0x1
#define _CVRCON_CVR1_POSN                                   0x1
#define _CVRCON_CVR1_POSITION                               0x1
#define _CVRCON_CVR1_SIZE                                   0x1
#define _CVRCON_CVR1_LENGTH                                 0x1
#define _CVRCON_CVR1_MASK                                   0x2
#define _CVRCON_CVR2_POSN                                   0x2
#define _CVRCON_CVR2_POSITION                               0x2
#define _CVRCON_CVR2_SIZE                                   0x1
#define _CVRCON_CVR2_LENGTH                                 0x1
#define _CVRCON_CVR2_MASK                                   0x4
#define _CVRCON_CVR3_POSN                                   0x3
#define _CVRCON_CVR3_POSITION                               0x3
#define _CVRCON_CVR3_SIZE                                   0x1
#define _CVRCON_CVR3_LENGTH                                 0x1
#define _CVRCON_CVR3_MASK                                   0x8
#define _CVRCON_CVROEN_POSN                                 0x6
#define _CVRCON_CVROEN_POSITION                             0x6
#define _CVRCON_CVROEN_SIZE                                 0x1
#define _CVRCON_CVROEN_LENGTH                               0x1
#define _CVRCON_CVROEN_MASK                                 0x40

// Register: PMSTATL
#define PMSTATL PMSTATL
extern volatile unsigned char           PMSTATL             __at(0xF54);
#ifndef _LIB_BUILD
asm("PMSTATL equ 0F54h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OB0E                   :1;
        unsigned OB1E                   :1;
        unsigned OB2E                   :1;
        unsigned OB3E                   :1;
        unsigned                        :2;
        unsigned OBUF                   :1;
        unsigned OBE                    :1;
    };
} PMSTATLbits_t;
extern volatile PMSTATLbits_t PMSTATLbits __at(0xF54);
// bitfield macros
#define _PMSTATL_OB0E_POSN                                  0x0
#define _PMSTATL_OB0E_POSITION                              0x0
#define _PMSTATL_OB0E_SIZE                                  0x1
#define _PMSTATL_OB0E_LENGTH                                0x1
#define _PMSTATL_OB0E_MASK                                  0x1
#define _PMSTATL_OB1E_POSN                                  0x1
#define _PMSTATL_OB1E_POSITION                              0x1
#define _PMSTATL_OB1E_SIZE                                  0x1
#define _PMSTATL_OB1E_LENGTH                                0x1
#define _PMSTATL_OB1E_MASK                                  0x2
#define _PMSTATL_OB2E_POSN                                  0x2
#define _PMSTATL_OB2E_POSITION                              0x2
#define _PMSTATL_OB2E_SIZE                                  0x1
#define _PMSTATL_OB2E_LENGTH                                0x1
#define _PMSTATL_OB2E_MASK                                  0x4
#define _PMSTATL_OB3E_POSN                                  0x3
#define _PMSTATL_OB3E_POSITION                              0x3
#define _PMSTATL_OB3E_SIZE                                  0x1
#define _PMSTATL_OB3E_LENGTH                                0x1
#define _PMSTATL_OB3E_MASK                                  0x8
#define _PMSTATL_OBUF_POSN                                  0x6
#define _PMSTATL_OBUF_POSITION                              0x6
#define _PMSTATL_OBUF_SIZE                                  0x1
#define _PMSTATL_OBUF_LENGTH                                0x1
#define _PMSTATL_OBUF_MASK                                  0x40
#define _PMSTATL_OBE_POSN                                   0x7
#define _PMSTATL_OBE_POSITION                               0x7
#define _PMSTATL_OBE_SIZE                                   0x1
#define _PMSTATL_OBE_LENGTH                                 0x1
#define _PMSTATL_OBE_MASK                                   0x80

