MikroElektronika/core_packages/PIC/XC8/def/PIC18LF46J13/mcu.h
extern volatile __bit                   PMDPSP              __at(0x75D7);	// @ (0xEBA * 8 + 7)
#define                                 PMDPSP_bit          _BIT_ACCESS(PMDIS1,7)
// PMDIS1<PMDRTCC>
extern volatile __bit                   PMDRTCC             __at(0x75D5);	// @ (0xEBA * 8 + 5)
#define                                 PMDRTCC_bit         _BIT_ACCESS(PMDIS1,5)
// PMDIS1<PMDTMR1>
extern volatile __bit                   PMDTMR1             __at(0x75D1);	// @ (0xEBA * 8 + 1)
#define                                 PMDTMR1_bit         _BIT_ACCESS(PMDIS1,1)
// PMDIS1<PMDTMR2>
extern volatile __bit                   PMDTMR2             __at(0x75D2);	// @ (0xEBA * 8 + 2)
#define                                 PMDTMR2_bit         _BIT_ACCESS(PMDIS1,2)
// PMDIS1<PMDTMR3>
extern volatile __bit                   PMDTMR3             __at(0x75D3);	// @ (0xEBA * 8 + 3)
#define                                 PMDTMR3_bit         _BIT_ACCESS(PMDIS1,3)
// PMDIS1<PMDTMR4>
extern volatile __bit                   PMDTMR4             __at(0x75D4);	// @ (0xEBA * 8 + 4)
#define                                 PMDTMR4_bit         _BIT_ACCESS(PMDIS1,4)
// PMDIS2<PMDTMR5>
extern volatile __bit                   PMDTMR5             __at(0x75DB);	// @ (0xEBB * 8 + 3)
#define                                 PMDTMR5_bit         _BIT_ACCESS(PMDIS2,3)
// PMDIS2<PMDTMR6>
extern volatile __bit                   PMDTMR6             __at(0x75DC);	// @ (0xEBB * 8 + 4)
#define                                 PMDTMR6_bit         _BIT_ACCESS(PMDIS2,4)
// PMDIS2<PMDTMR8>
extern volatile __bit                   PMDTMR8             __at(0x75DE);	// @ (0xEBB * 8 + 6)
#define                                 PMDTMR8_bit         _BIT_ACCESS(PMDIS2,6)
// PMDIS0<PMDUART1>
extern volatile __bit                   PMDUART1            __at(0x75CB);	// @ (0xEB9 * 8 + 3)
#define                                 PMDUART1_bit        _BIT_ACCESS(PMDIS0,3)
// PMDIS0<PMDUART2>
extern volatile __bit                   PMDUART2            __at(0x75CC);	// @ (0xEB9 * 8 + 4)
#define                                 PMDUART2_bit        _BIT_ACCESS(PMDIS0,4)
// PORTB<PMPBE>
extern volatile __bit                   PMPBE               __at(0x7C09);	// @ (0xF81 * 8 + 1)
#define                                 PMPBE_bit           _BIT_ACCESS(PORTB,1)
// PORTE<PMPCS>
extern volatile __bit                   PMPCS               __at(0x7C22);	// @ (0xF84 * 8 + 2)
#define                                 PMPCS_bit           _BIT_ACCESS(PORTE,2)
// PMCONH<PMPEN>
extern volatile __bit                   PMPEN               __at(0x7AFF);	// @ (0xF5F * 8 + 7)
#define                                 PMPEN_bit           _BIT_ACCESS(PMCONH,7)
// PIE1<PMPIE>
extern volatile __bit                   PMPIE               __at(0x7CEF);	// @ (0xF9D * 8 + 7)
#define                                 PMPIE_bit           _BIT_ACCESS(PIE1,7)
// PIR1<PMPIF>
extern volatile __bit                   PMPIF               __at(0x7CF7);	// @ (0xF9E * 8 + 7)
#define                                 PMPIF_bit           _BIT_ACCESS(PIR1,7)
// IPR1<PMPIP>
extern volatile __bit                   PMPIP               __at(0x7CFF);	// @ (0xF9F * 8 + 7)
#define                                 PMPIP_bit           _BIT_ACCESS(IPR1,7)
// PORTE<PMPRD>
extern volatile __bit                   PMPRD               __at(0x7C20);	// @ (0xF84 * 8 + 0)
#define                                 PMPRD_bit           _BIT_ACCESS(PORTE,0)
// PADCFG1<PMPTTL>
extern volatile __bit                   PMPTTL              __at(0x79E0);	// @ (0xF3C * 8 + 0)
#define                                 PMPTTL_bit          _BIT_ACCESS(PADCFG1,0)
// PORTE<PMPWR>
extern volatile __bit                   PMPWR               __at(0x7C21);	// @ (0xF84 * 8 + 1)
#define                                 PMPWR_bit           _BIT_ACCESS(PORTE,1)
// PORTE<PMRD>
extern volatile __bit                   PMRD                __at(0x7C20);	// @ (0xF84 * 8 + 0)
#define                                 PMRD_bit            _BIT_ACCESS(PORTE,0)
// PORTE<PMWR>
extern volatile __bit                   PMWR                __at(0x7C21);	// @ (0xF84 * 8 + 1)
#define                                 PMWR_bit            _BIT_ACCESS(PORTE,1)
// RCON<POR>
extern volatile __bit                   POR                 __at(0x7E81);	// @ (0xFD0 * 8 + 1)
#define                                 POR_bit             _BIT_ACCESS(RCON,1)
// OSCCON2<PRISD>
extern volatile __bit                   PRISD               __at(0x7C3A);	// @ (0xF87 * 8 + 2)
#define                                 PRISD_bit           _BIT_ACCESS(OSCCON2,2)
// T0CON<PSA>
extern volatile __bit                   PSA                 __at(0x7EAB);	// @ (0xFD5 * 8 + 3)
#define                                 PSA_bit             _BIT_ACCESS(T0CON,3)
// PIE1<PSPIE>
extern volatile __bit                   PSPIE               __at(0x7CEF);	// @ (0xF9D * 8 + 7)
#define                                 PSPIE_bit           _BIT_ACCESS(PIE1,7)
// PIR1<PSPIF>
extern volatile __bit                   PSPIF               __at(0x7CF7);	// @ (0xF9E * 8 + 7)
#define                                 PSPIF_bit           _BIT_ACCESS(PIR1,7)
// IPR1<PSPIP>
extern volatile __bit                   PSPIP               __at(0x7CFF);	// @ (0xF9F * 8 + 7)
#define                                 PSPIP_bit           _BIT_ACCESS(IPR1,7)
// PMDIS1<PSPMD>
extern volatile __bit                   PSPMD               __at(0x75D7);	// @ (0xEBA * 8 + 7)
#define                                 PSPMD_bit           _BIT_ACCESS(PMDIS1,7)
// ECCP1AS<PSS1AC0>
extern volatile __bit                   PSS1AC0             __at(0x7DF2);	// @ (0xFBE * 8 + 2)
#define                                 PSS1AC0_bit         _BIT_ACCESS(ECCP1AS,2)
// ECCP1AS<PSS1AC1>
extern volatile __bit                   PSS1AC1             __at(0x7DF3);	// @ (0xFBE * 8 + 3)
#define                                 PSS1AC1_bit         _BIT_ACCESS(ECCP1AS,3)
// ECCP1AS<PSS1BD0>
extern volatile __bit                   PSS1BD0             __at(0x7DF0);	// @ (0xFBE * 8 + 0)
#define                                 PSS1BD0_bit         _BIT_ACCESS(ECCP1AS,0)
// ECCP1AS<PSS1BD1>
extern volatile __bit                   PSS1BD1             __at(0x7DF1);	// @ (0xFBE * 8 + 1)
#define                                 PSS1BD1_bit         _BIT_ACCESS(ECCP1AS,1)
// ECCP2AS<PSS2AC0>
extern volatile __bit                   PSS2AC0             __at(0x7DC2);	// @ (0xFB8 * 8 + 2)
#define                                 PSS2AC0_bit         _BIT_ACCESS(ECCP2AS,2)
// ECCP2AS<PSS2AC1>
extern volatile __bit                   PSS2AC1             __at(0x7DC3);	// @ (0xFB8 * 8 + 3)
#define                                 PSS2AC1_bit         _BIT_ACCESS(ECCP2AS,3)
// ECCP2AS<PSS2BD0>
extern volatile __bit                   PSS2BD0             __at(0x7DC0);	// @ (0xFB8 * 8 + 0)
#define                                 PSS2BD0_bit         _BIT_ACCESS(ECCP2AS,0)
// ECCP2AS<PSS2BD1>
extern volatile __bit                   PSS2BD1             __at(0x7DC1);	// @ (0xFB8 * 8 + 1)
#define                                 PSS2BD1_bit         _BIT_ACCESS(ECCP2AS,1)
// ECCP3AS<PSS3AC0>
extern volatile __bit                   PSS3AC0             __at(0x78CA);	// @ (0xF19 * 8 + 2)
#define                                 PSS3AC0_bit         _BIT_ACCESS(ECCP3AS,2)
// ECCP3AS<PSS3AC1>
extern volatile __bit                   PSS3AC1             __at(0x78CB);	// @ (0xF19 * 8 + 3)
#define                                 PSS3AC1_bit         _BIT_ACCESS(ECCP3AS,3)
// ECCP3AS<PSS3BD0>
extern volatile __bit                   PSS3BD0             __at(0x78C8);	// @ (0xF19 * 8 + 0)
#define                                 PSS3BD0_bit         _BIT_ACCESS(ECCP3AS,0)
// ECCP3AS<PSS3BD1>
extern volatile __bit                   PSS3BD1             __at(0x78C9);	// @ (0xF19 * 8 + 1)
#define                                 PSS3BD1_bit         _BIT_ACCESS(ECCP3AS,1)
// PMCONH<PTBEEN>
extern volatile __bit                   PTBEEN              __at(0x7AFA);	// @ (0xF5F * 8 + 2)
#define                                 PTBEEN_bit          _BIT_ACCESS(PMCONH,2)
// PMEL<PTEN0>
extern volatile __bit                   PTEN0               __at(0x7AB0);	// @ (0xF56 * 8 + 0)
#define                                 PTEN0_bit           _BIT_ACCESS(PMEL,0)
// PMEL<PTEN1>
extern volatile __bit                   PTEN1               __at(0x7AB1);	// @ (0xF56 * 8 + 1)
#define                                 PTEN1_bit           _BIT_ACCESS(PMEL,1)
// PMEH<PTEN10>
extern volatile __bit                   PTEN10              __at(0x7ABA);	// @ (0xF57 * 8 + 2)
#define                                 PTEN10_bit          _BIT_ACCESS(PMEH,2)
// PMEH<PTEN11>
extern volatile __bit                   PTEN11              __at(0x7ABB);	// @ (0xF57 * 8 + 3)
#define                                 PTEN11_bit          _BIT_ACCESS(PMEH,3)
// PMEH<PTEN12>
extern volatile __bit                   PTEN12              __at(0x7ABC);	// @ (0xF57 * 8 + 4)
#define                                 PTEN12_bit          _BIT_ACCESS(PMEH,4)
// PMEH<PTEN13>
extern volatile __bit                   PTEN13              __at(0x7ABD);	// @ (0xF57 * 8 + 5)
#define                                 PTEN13_bit          _BIT_ACCESS(PMEH,5)
// PMEH<PTEN14>
extern volatile __bit                   PTEN14              __at(0x7ABE);	// @ (0xF57 * 8 + 6)
#define                                 PTEN14_bit          _BIT_ACCESS(PMEH,6)
// PMEH<PTEN15>
extern volatile __bit                   PTEN15              __at(0x7ABF);	// @ (0xF57 * 8 + 7)
#define                                 PTEN15_bit          _BIT_ACCESS(PMEH,7)
// PMEL<PTEN2>
extern volatile __bit                   PTEN2               __at(0x7AB2);	// @ (0xF56 * 8 + 2)
#define                                 PTEN2_bit           _BIT_ACCESS(PMEL,2)
// PMEL<PTEN3>
extern volatile __bit                   PTEN3               __at(0x7AB3);	// @ (0xF56 * 8 + 3)
#define                                 PTEN3_bit           _BIT_ACCESS(PMEL,3)
// PMEL<PTEN4>
extern volatile __bit                   PTEN4               __at(0x7AB4);	// @ (0xF56 * 8 + 4)
#define                                 PTEN4_bit           _BIT_ACCESS(PMEL,4)
// PMEL<PTEN5>
extern volatile __bit                   PTEN5               __at(0x7AB5);	// @ (0xF56 * 8 + 5)
#define                                 PTEN5_bit           _BIT_ACCESS(PMEL,5)
// PMEL<PTEN6>
extern volatile __bit                   PTEN6               __at(0x7AB6);	// @ (0xF56 * 8 + 6)
#define                                 PTEN6_bit           _BIT_ACCESS(PMEL,6)
// PMEL<PTEN7>
extern volatile __bit                   PTEN7               __at(0x7AB7);	// @ (0xF56 * 8 + 7)
#define                                 PTEN7_bit           _BIT_ACCESS(PMEL,7)
// PMEH<PTEN8>
extern volatile __bit                   PTEN8               __at(0x7AB8);	// @ (0xF57 * 8 + 0)
#define                                 PTEN8_bit           _BIT_ACCESS(PMEH,0)
// PMEH<PTEN9>
extern volatile __bit                   PTEN9               __at(0x7AB9);	// @ (0xF57 * 8 + 1)
#define                                 PTEN9_bit           _BIT_ACCESS(PMEH,1)
// PMCONH<PTRDEN>
extern volatile __bit                   PTRDEN              __at(0x7AF8);	// @ (0xF5F * 8 + 0)
#define                                 PTRDEN_bit          _BIT_ACCESS(PMCONH,0)
// PMCONH<PTWREN>
extern volatile __bit                   PTWREN              __at(0x7AF9);	// @ (0xF5F * 8 + 1)
#define                                 PTWREN_bit          _BIT_ACCESS(PMCONH,1)
// PORTA<RA0>
extern volatile __bit                   RA0                 __at(0x7C00);	// @ (0xF80 * 8 + 0)
#define                                 RA0_bit             _BIT_ACCESS(PORTA,0)
// PORTA<RA1>
extern volatile __bit                   RA1                 __at(0x7C01);	// @ (0xF80 * 8 + 1)
#define                                 RA1_bit             _BIT_ACCESS(PORTA,1)
// PORTA<RA2>
extern volatile __bit                   RA2                 __at(0x7C02);	// @ (0xF80 * 8 + 2)
#define                                 RA2_bit             _BIT_ACCESS(PORTA,2)
// PORTA<RA3>
extern volatile __bit                   RA3                 __at(0x7C03);	// @ (0xF80 * 8 + 3)
#define                                 RA3_bit             _BIT_ACCESS(PORTA,3)
// PORTA<RA5>
extern volatile __bit                   RA5                 __at(0x7C05);	// @ (0xF80 * 8 + 5)
#define                                 RA5_bit             _BIT_ACCESS(PORTA,5)
// PORTA<RA6>
extern volatile __bit                   RA6                 __at(0x7C06);	// @ (0xF80 * 8 + 6)
#define                                 RA6_bit             _BIT_ACCESS(PORTA,6)
// PORTA<RA7>
extern volatile __bit                   RA7                 __at(0x7C07);	// @ (0xF80 * 8 + 7)
#define                                 RA7_bit             _BIT_ACCESS(PORTA,7)
// PORTB<RB0>
extern volatile __bit                   RB0                 __at(0x7C08);	// @ (0xF81 * 8 + 0)
#define                                 RB0_bit             _BIT_ACCESS(PORTB,0)
// PORTB<RB1>
extern volatile __bit                   RB1                 __at(0x7C09);	// @ (0xF81 * 8 + 1)
#define                                 RB1_bit             _BIT_ACCESS(PORTB,1)
// PORTB<RB2>
extern volatile __bit                   RB2                 __at(0x7C0A);	// @ (0xF81 * 8 + 2)
#define                                 RB2_bit             _BIT_ACCESS(PORTB,2)
// PORTB<RB3>
extern volatile __bit                   RB3                 __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 RB3_bit             _BIT_ACCESS(PORTB,3)
// PORTB<RB4>
extern volatile __bit                   RB4                 __at(0x7C0C);	// @ (0xF81 * 8 + 4)
#define                                 RB4_bit             _BIT_ACCESS(PORTB,4)
// PORTB<RB5>
extern volatile __bit                   RB5                 __at(0x7C0D);	// @ (0xF81 * 8 + 5)
#define                                 RB5_bit             _BIT_ACCESS(PORTB,5)
// PORTB<RB6>
extern volatile __bit                   RB6                 __at(0x7C0E);	// @ (0xF81 * 8 + 6)
#define                                 RB6_bit             _BIT_ACCESS(PORTB,6)
// PORTB<RB7>
extern volatile __bit                   RB7                 __at(0x7C0F);	// @ (0xF81 * 8 + 7)
#define                                 RB7_bit             _BIT_ACCESS(PORTB,7)
// INTCON<RBIE>
extern volatile __bit                   RBIE                __at(0x7F93);	// @ (0xFF2 * 8 + 3)
#define                                 RBIE_bit            _BIT_ACCESS(INTCON,3)
// INTCON<RBIF>
extern volatile __bit                   RBIF                __at(0x7F90);	// @ (0xFF2 * 8 + 0)
#define                                 RBIF_bit            _BIT_ACCESS(INTCON,0)
// INTCON2<RBIP>
extern volatile __bit                   RBIP                __at(0x7F88);	// @ (0xFF1 * 8 + 0)
#define                                 RBIP_bit            _BIT_ACCESS(INTCON2,0)
// INTCON2<RBPU>
extern volatile __bit                   RBPU                __at(0x7F8F);	// @ (0xFF1 * 8 + 7)
#define                                 RBPU_bit            _BIT_ACCESS(INTCON2,7)
// PORTC<RC0>
extern volatile __bit                   RC0                 __at(0x7C10);	// @ (0xF82 * 8 + 0)
#define                                 RC0_bit             _BIT_ACCESS(PORTC,0)
// PORTC<RC1>
extern volatile __bit                   RC1                 __at(0x7C11);	// @ (0xF82 * 8 + 1)
#define                                 RC1_bit             _BIT_ACCESS(PORTC,1)
// PIE1<RC1IE>
extern volatile __bit                   RC1IE               __at(0x7CED);	// @ (0xF9D * 8 + 5)
#define                                 RC1IE_bit           _BIT_ACCESS(PIE1,5)
// PIR1<RC1IF>
extern volatile __bit                   RC1IF               __at(0x7CF5);	// @ (0xF9E * 8 + 5)
#define                                 RC1IF_bit           _BIT_ACCESS(PIR1,5)
// IPR1<RC1IP>
extern volatile __bit                   RC1IP               __at(0x7CFD);	// @ (0xF9F * 8 + 5)
#define                                 RC1IP_bit           _BIT_ACCESS(IPR1,5)
// PORTC<RC2>
extern volatile __bit                   RC2                 __at(0x7C12);	// @ (0xF82 * 8 + 2)
#define                                 RC2_bit             _BIT_ACCESS(PORTC,2)
// PIE3<RC2IE>
extern volatile __bit                   RC2IE               __at(0x7D1D);	// @ (0xFA3 * 8 + 5)
#define                                 RC2IE_bit           _BIT_ACCESS(PIE3,5)
// PIR3<RC2IF>
extern volatile __bit                   RC2IF               __at(0x7D25);	// @ (0xFA4 * 8 + 5)
#define                                 RC2IF_bit           _BIT_ACCESS(PIR3,5)
// IPR3<RC2IP>
extern volatile __bit                   RC2IP               __at(0x7D2D);	// @ (0xFA5 * 8 + 5)
#define                                 RC2IP_bit           _BIT_ACCESS(IPR3,5)
// PORTC<RC3>
extern volatile __bit                   RC3                 __at(0x7C13);	// @ (0xF82 * 8 + 3)
#define                                 RC3_bit             _BIT_ACCESS(PORTC,3)
// PORTC<RC4>
extern volatile __bit                   RC4                 __at(0x7C14);	// @ (0xF82 * 8 + 4)
#define                                 RC4_bit             _BIT_ACCESS(PORTC,4)
// PORTC<RC5>
extern volatile __bit                   RC5                 __at(0x7C15);	// @ (0xF82 * 8 + 5)
#define                                 RC5_bit             _BIT_ACCESS(PORTC,5)
// PORTC<RC6>
extern volatile __bit                   RC6                 __at(0x7C16);	// @ (0xF82 * 8 + 6)
#define                                 RC6_bit             _BIT_ACCESS(PORTC,6)
// PORTC<RC7>
extern volatile __bit                   RC7                 __at(0x7C17);	// @ (0xF82 * 8 + 7)
#define                                 RC7_bit             _BIT_ACCESS(PORTC,7)
// RCSTA1<RC8_9>
extern volatile __bit                   RC8_9               __at(0x7D66);	// @ (0xFAC * 8 + 6)
#define                                 RC8_9_bit           _BIT_ACCESS(RCSTA1,6)
// RCSTA2<RC8_92>
extern volatile __bit                   RC8_92              __at(0x7CE6);	// @ (0xF9C * 8 + 6)
#define                                 RC8_92_bit          _BIT_ACCESS(RCSTA2,6)
// RCSTA1<RC9>
extern volatile __bit                   RC9                 __at(0x7D66);	// @ (0xFAC * 8 + 6)
#define                                 RC9_bit             _BIT_ACCESS(RCSTA1,6)
// RCSTA2<RC92>
extern volatile __bit                   RC92                __at(0x7CE6);	// @ (0xF9C * 8 + 6)
#define                                 RC92_bit            _BIT_ACCESS(RCSTA2,6)
// RCSTA1<RCD8>
extern volatile __bit                   RCD8                __at(0x7D60);	// @ (0xFAC * 8 + 0)
#define                                 RCD8_bit            _BIT_ACCESS(RCSTA1,0)
// RCSTA2<RCD82>
extern volatile __bit                   RCD82               __at(0x7CE0);	// @ (0xF9C * 8 + 0)
#define                                 RCD82_bit           _BIT_ACCESS(RCSTA2,0)
// SSP1CON2<RCEN1>
extern volatile __bit                   RCEN1               __at(0x7E2B);	// @ (0xFC5 * 8 + 3)
#define                                 RCEN1_bit           _BIT_ACCESS(SSP1CON2,3)
// SSP2CON2<RCEN2>
extern volatile __bit                   RCEN2               __at(0x7B8B);	// @ (0xF71 * 8 + 3)
#define                                 RCEN2_bit           _BIT_ACCESS(SSP2CON2,3)
// BAUDCON1<RCIDL1>
extern volatile __bit                   RCIDL1              __at(0x7BF6);	// @ (0xF7E * 8 + 6)
#define                                 RCIDL1_bit          _BIT_ACCESS(BAUDCON1,6)
// BAUDCON2<RCIDL2>
extern volatile __bit                   RCIDL2              __at(0x7BE6);	// @ (0xF7C * 8 + 6)
#define                                 RCIDL2_bit          _BIT_ACCESS(BAUDCON2,6)
// PIE1<RCIE>
extern volatile __bit                   RCIE                __at(0x7CED);	// @ (0xF9D * 8 + 5)
#define                                 RCIE_bit            _BIT_ACCESS(PIE1,5)
// PIR1<RCIF>
extern volatile __bit                   RCIF                __at(0x7CF5);	// @ (0xF9E * 8 + 5)
#define                                 RCIF_bit            _BIT_ACCESS(PIR1,5)
// IPR1<RCIP>
extern volatile __bit                   RCIP                __at(0x7CFD);	// @ (0xF9F * 8 + 5)
#define                                 RCIP_bit            _BIT_ACCESS(IPR1,5)
// BAUDCON1<RCMT>
extern volatile __bit                   RCMT                __at(0x7BF6);	// @ (0xF7E * 8 + 6)
#define                                 RCMT_bit            _BIT_ACCESS(BAUDCON1,6)
// BAUDCON1<RCMT1>
extern volatile __bit                   RCMT1               __at(0x7BF6);	// @ (0xF7E * 8 + 6)
#define                                 RCMT1_bit           _BIT_ACCESS(BAUDCON1,6)
// BAUDCON2<RCMT2>
extern volatile __bit                   RCMT2               __at(0x7BE6);	// @ (0xF7C * 8 + 6)
#define                                 RCMT2_bit           _BIT_ACCESS(BAUDCON2,6)
// PORTD<RD0>
extern volatile __bit                   RD0                 __at(0x7C18);	// @ (0xF83 * 8 + 0)
#define                                 RD0_bit             _BIT_ACCESS(PORTD,0)
// PORTD<RD1>
extern volatile __bit                   RD1                 __at(0x7C19);	// @ (0xF83 * 8 + 1)
#define                                 RD1_bit             _BIT_ACCESS(PORTD,1)
// T3CON<RD163>
extern volatile __bit                   RD163               __at(0x7BCF);	// @ (0xF79 * 8 + 7)
#define                                 RD163_bit           _BIT_ACCESS(T3CON,7)
// T5CON<RD165>
extern volatile __bit                   RD165               __at(0x7911);	// @ (0xF22 * 8 + 1)
#define                                 RD165_bit           _BIT_ACCESS(T5CON,1)
// PORTD<RD2>
extern volatile __bit                   RD2                 __at(0x7C1A);	// @ (0xF83 * 8 + 2)
#define                                 RD2_bit             _BIT_ACCESS(PORTD,2)
// PORTD<RD3>
extern volatile __bit                   RD3                 __at(0x7C1B);	// @ (0xF83 * 8 + 3)
#define                                 RD3_bit             _BIT_ACCESS(PORTD,3)
// PORTD<RD4>
extern volatile __bit                   RD4                 __at(0x7C1C);	// @ (0xF83 * 8 + 4)
#define                                 RD4_bit             _BIT_ACCESS(PORTD,4)
// PORTD<RD5>
extern volatile __bit                   RD5                 __at(0x7C1D);	// @ (0xF83 * 8 + 5)
#define                                 RD5_bit             _BIT_ACCESS(PORTD,5)
// PORTD<RD6>
extern volatile __bit                   RD6                 __at(0x7C1E);	// @ (0xF83 * 8 + 6)
#define                                 RD6_bit             _BIT_ACCESS(PORTD,6)
// PORTD<RD7>
extern volatile __bit                   RD7                 __at(0x7C1F);	// @ (0xF83 * 8 + 7)
#define                                 RD7_bit             _BIT_ACCESS(PORTD,7)
// PORTE<RDE>
extern volatile __bit                   RDE                 __at(0x7C20);	// @ (0xF84 * 8 + 0)
#define                                 RDE_bit             _BIT_ACCESS(PORTE,0)
// TRISE<RDPU>
extern volatile __bit                   RDPU                __at(0x7CB7);	// @ (0xF96 * 8 + 7)
#define                                 RDPU_bit            _BIT_ACCESS(TRISE,7)
// PMCONL<RDSP>
extern volatile __bit                   RDSP                __at(0x7AF0);	// @ (0xF5E * 8 + 0)
#define                                 RDSP_bit            _BIT_ACCESS(PMCONL,0)
// PORTE<RE0>
extern volatile __bit                   RE0                 __at(0x7C20);	// @ (0xF84 * 8 + 0)
#define                                 RE0_bit             _BIT_ACCESS(PORTE,0)
// PORTE<RE1>
extern volatile __bit                   RE1                 __at(0x7C21);	// @ (0xF84 * 8 + 1)
#define                                 RE1_bit             _BIT_ACCESS(PORTE,1)
// PORTE<RE2>
extern volatile __bit                   RE2                 __at(0x7C22);	// @ (0xF84 * 8 + 2)
